Revit 2026 API

# MultiReferenceAnnotationOptionsReferencesDontMatchReferenceCategory Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ReferencesDontMatchReferenceCategory(
	IList<Reference> references
)
```
```vb
Public Function ReferencesDontMatchReferenceCategory (
	references As IList(Of Reference)
) As Boolean
```
```cpp
public:
bool ReferencesDontMatchReferenceCategory(
	IList<Reference^>^ references
)
```
```fsharp
member ReferencesDontMatchReferenceCategory :
        references : IList<Reference> -> bool
```

#### Parameters

references IListReference

#### Return Value

Boolean

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace